24-rails-api/movies-api/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    movies = Movie.all.sort_by { |movie| movie.year }

INSERT INTO "movies" ("title", "year", "genre", "score", "imageUrl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 1], ["updated_at", "2020-08-10 15:17:31.595183"], ["id", 12]]
---
  def update
    movie = Movie.find(params[:id])

    movie.update!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 11]]
---
  def destroy
    movie = Movie.find(params[:id])

    movie.destroy!